
- теряется последний символ при плотной прорисовке объектов

- пометки < > не снимаются командой '_mark -'

- не работает автоматика памяти для itmbuf: 'v rpm' падает в core,
  'v -b512 rpm' OK!

- job control: закончить поддержку отключения, сейчас работает только установка флага -j
  и почти (но не до конца) отлажена работа
  
- man vash: актуализировать...

- при наличии в команде '##'при отсутствии пометки блокировать выполнение 

- убрать с экрана setup отладочные переменные про память для itmbuf

-- wsobj_t/obj_t: закончить документирование кода и навести ревизию (давно все работает)

