/*
**      +----------+    БИБЛИОТЕКА ВВОДА-ВЫВОДА
**     (c) linlib  !    ДЛЯ АЛФАВИТНО-ЦИФРОВЫХ
**      +----------+    ВИДЕОТЕРМИНАЛОВ
**/

/*
 *      $Header: lin465.c,v 3.1 89/08/29 14:50:32 vsv Rel $
 *
 *      $Log:	lin465.c,v $
 * Revision 3.1  89/08/29  14:50:32  vsv
 * ВЕРСИЯ LINLIB_3
 * 
 * Revision 3.0  88/06/16  18:05:20  vsv
 * ПРЕДВАРИТЕЛЬНЫЙ ВЫПУСК
 * 
 */

#include <stdio.h>
#include "line.h"

/*-----------------------------*/
/* ВЫВОД СПРАВОЧНОЙ ИНФОРМАЦИИ */
/* С ПРЕДВАРИТЕЛЬНЫМ СТИРАНИЕМ */
/* УЧАСТКА ЭКРАНА              */
/*-----------------------------*/
help ( from, to, text )
int     from;           /* ВЕРХНЯЯ ГРАНИЦА (НОМЕР СТРОКИ НА ЭКРАНЕ) */
int     to;             /* НИЖНЯЯ ГРАНИЦА */
char    **text;         /* СПРАВОЧНЫЙ ТЕКСТ */
{
	register i ;

	er_scr(from, to, TXT); /* TODO check using function help(), may be never used */

	if(text) {
		for( i=from; *text; i++) {
			cp_set( i, 0, TXT);
			w_str( *text++ );   /* ПОКАЗАТЬ ТЕКСТ НА ЭКРАНЕ */
		}
	}
}
