/*
**      +----------+    גיגליןפוכב קקןהב-קשקןהב
**     (c) linlib  !    הלס בלזבקיפמן-דיזעןקשט
**      +----------+    קיהוןפועםימבלןק
**/

/*
 *      $Header: lin465.c,v 3.1 89/08/29 14:50:32 vsv Rel $
 *
 *      $Log:	lin465.c,v $
 * Revision 3.1  89/08/29  14:50:32  vsv
 * קועףיס LINLIB_3
 * 
 * Revision 3.0  88/06/16  18:05:20  vsv
 * נעוהקבעיפולרמשך קשנץףכ
 * 
 */

#include <stdio.h>
#include "line.h"

/*-----------------------------*/
/* קשקןה ףנעבקן‏מןך ימזןעםבדיי */
/* ף נעוהקבעיפולרמשם ףפיעבמיום */
/* ץ‏בףפכב üכעבמב              */
/*-----------------------------*/
help ( from, to, text )
int     from;           /* קועטמסס חעבמידב (מןםוע ףפעןכי מב üכעבמו) */
int     to;             /* מיצמסס חעבמידב */
char    **text;         /* ףנעבקן‏משך פוכףפ */
{
	register i ;

	er_scr(from, to, TXT); /* TODO check using function help(), may be never used */

	if(text) {
		for( i=from; *text; i++) {
			cp_set( i, 0, TXT);
			w_str( *text++ );   /* נןכבתבפר פוכףפ מב üכעבמו */
		}
	}
}
