/*
**      +----------+    גיגליןפוכב קקןהב-קשקןהב
**     (c) linlib  !    הלס בלזבקיפמן-דיזעןקשט
**      +----------+    קיהוןפועםימבלןק
**/

/*
 *      $Header: lin450.c,v 3.1 89/08/29 14:50:18 vsv Rel $
 *
 *      $Log:	lin450.c,v $
 * Revision 3.1  89/08/29  14:50:18  vsv
 * קועףיס LINLIB_3
 * 
 * Revision 3.0  88/06/16  18:04:04  vsv
 * נעוהקבעיפולרמשך קשנץףכ
 * 
 */

#include "line.h"

/*
 * "פוףפיעץא‎בס" זץמכדיס הלס םומא.
 * וףלי line->cvtf, פן קשתשקבופףס ץכבתבממבס זץמכדיס;
 * וףלי line->cvts, פן קשתשקבופףס כןם. זבךל UNIX
 *
 * זץמכדיס קןתקעב‎בופ TRUE ילי FALSE, ק תבקיףיםןףפי ןפ
 * פןחן, ‏פן קועמץלי וך.
 *
 */

int
tst_m(line, cod)
register LINE *line;
	 kbcod cod;
{
	/*
	 * נןכב עובליתןקבמ פןלרכן קשתןק ןגש‏משט זץמכדיך סתשכב ףי.
	 */
	if(cod == ' ') {
		if(line->cvtf) {
			return( (*line->cvtf)() );
		}
	}
	return(TRUE);   /* מב קףסכיך ףלץ‏בך */
}
