/*
**      +----------+    גיגליןפוכב קקןהב-קשקןהב
**     (c) linlib  !    הלס בלזבקיפמן-דיזעןקשט
**      +----------+    קיהוןפועםימבלןק
**/

/*
 *      $Header: lin245.c,v 1.1 90/12/27 16:29:10 vsv Rel $
 *
 *      $Log:	lin245.c,v $
 * Revision 1.1  90/12/27  16:29:10  vsv
 * קועףיס LINLIB_3
 * 
 * Revision 3.1  89/08/29  15:16:37  vsv
 * קועףיס LINLIB_3
 * 
 * Revision 3.0  88/06/16  17:59:17  vsv
 * נעוהקבעיפולרמשך קשנץףכ
 * 
 */

/*-----------------------------------------------*/
/* תבחלץûכב הלס ץכבתבפולס מב יםס זבךלב מבףפעןךכי */
/*-----------------------------------------------*/

char   *filelh = 0;
