/*
**      +----------+    גיגליןפוכב קקןהב-קשקןהב
**     (c) linlib  !    הלס בלזבקיפמן-דיזעןקשט
**      +----------+    קיהוןפועםימבלןק
**/

/*
 *      $Header: lin345.c,v 1.1 90/12/27 16:29:24 vsv Rel $
 *
 *      $Log:	lin345.c,v $
 * Revision 1.1  90/12/27  16:29:24  vsv
 * קועףיס LINLIB_3
 * 
 * Revision 3.1  89/08/29  15:17:27  vsv
 * קועףיס LINLIB_3
 * 
 * Revision 3.0  88/08/02  10:47:05  vsv
 * נועקבס עוהבכדיס
 * 
 */

/*
 * זלבח: לאגןך נו‏בפמשך כןה ןפכעשקבופ לימיא הלס יתםומומיס;
 *       (נן ץםןל‏במיא פןלרכן נעןגול/DEL).
 */

int     allcod = 0;
