/*
**      +----------+    БИБЛИОТЕКА ВВОДА-ВЫВОДА
**     (c) linlib  !    ДЛЯ АЛФАВИТНО-ЦИФРОВЫХ
**      +----------+    ВИДЕОТЕРМИНАЛОВ
**/

/*
 *      $Header: lin345.c,v 1.1 90/12/27 16:29:24 vsv Rel $
 *
 *      $Log:	lin345.c,v $
 * Revision 1.1  90/12/27  16:29:24  vsv
 * ВЕРСИЯ LINLIB_3
 * 
 * Revision 3.1  89/08/29  15:17:27  vsv
 * ВЕРСИЯ LINLIB_3
 * 
 * Revision 3.0  88/08/02  10:47:05  vsv
 * ПЕРВАЯ РЕДАКЦИЯ
 * 
 */

/*
 * ФЛАГ: ЛЮБОЙ ПЕЧАТНЫЙ КОД ОТКРЫВАЕТ ЛИНИЮ ДЛЯ ИЗМЕНЕНИЯ;
 *       (ПО УМОЛЧАНИЮ ТОЛЬКО ПРОБЕЛ/DEL).
 */

int     allcod = 0;
