/*
**      +----------+    βιβμιοτελα χχοδα-χωχοδα
**     (c) linlib  !    δμρ αμζαχιτξο-γιζςοχωθ
**      +----------+    χιδεοτεςνιξαμοχ
**/

/*
 *      $Header$
 *      $Log$
 */

#include <stdio.h>      /* ϊαηομοχολ σταξδαςτξοκ βιβμιοτελι χχ/χωχ */
#include "line.h"       /* ζακμ-ϊαηομοχολ LINLIB */

#ifdef RT11
/* $$narg = 1 ;            /* ξε χωδαχατψ ποδσλαϊλυ ξα χχοδ αςηυνεξτοχ */
#endif

main()
/*--------*/
/*  MAIN  */
/*--------*/
{
    hw_set();

    io_set(IO_VIDEO);

    vmain();    /* σν. ζακμ pvmain.cv */

    io_set(IO_TTYPE);

    exit(0);
}
